---
kind: method
id: M:Autodesk.Revit.DB.FabricationConfiguration.GetPartStatusDescription(System.Int32)
source: html/70e3afea-50e2-5ff4-867d-c39094edbf65.htm
---
# Autodesk.Revit.DB.FabricationConfiguration.GetPartStatusDescription Method

Gets the status description from its identifier.

## Syntax (C#)
```csharp
public string GetPartStatusDescription(
	int statusId
)
```

## Parameters
- **statusId** (`System.Int32`) - The status identifier.

## Returns
The status description.